#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Настройки команд отчетов

// Определяет объекты конфигурации, в модулях менеджеров которых предусмотрена процедура ДобавитьКомандыОтчетов,
// описывающая команды открытия контекстных отчетов.
// Синтаксис процедуры ДобавитьКомандыОтчетов см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами отчетов.
//
Процедура ОпределитьОбъектыСКомандамиПечати(Объекты) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		МодульВариантыОтчетовВложенныйМодуль = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетовВложенныйМодуль2");
		МодульВариантыОтчетовВложенныйМодуль.ОпределитьОбъектыСКомандамиПечати(Объекты);
	КонецЕсли;
	ОпределитьОбъектыСКомандамиПечатиЛокально(Объекты);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьОбъектыСКомандамиПечатиЛокально(Объекты)

	Объекты.Добавить(Документы.ОтчетыБезВызовов);

КонецПроцедуры

#КонецОбласти