#Область ПрограммныйИнтерфейс

// Обработчик команды формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма, из которой выполняется команда.
//   Команда - КомандаФормы - Выполняемая команда.
//   Источник - ТаблицаФормы, ДанныеФормыСтруктура - Объект или список формы с полем "Ссылка".
//
//@skip-warning
Процедура ВыполнитьКоманду(Форма, Команда, Источник) Экспорт

КонецПроцедуры

// Запускает отложенный процесс обновления команд печати на форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, на которой необходимо обновить команды печати.
//
//@skip-warning
Процедура НачатьОбновлениеКоманд(Форма) Экспорт

КонецПроцедуры

#КонецОбласти
