#Область СлужебныйПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ОпределитьОбъектыСКомандамиПечати(СписокОбъектов) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатьюВложенныйМодуль = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатьюВложенныйМодуль2");
		МодульУправлениеПечатьюВложенныйМодуль.ОпределитьОбъектыСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	ОпределитьОбъектыСКомандамиПечатиЛокально(СписокОбъектов);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ОтсутствующаяПодсистема") Тогда
		МодульОтсутствующийМодуль = ОбщегоНазначения.ОбщийМодуль("ОтсутствующийМодуль");
		МодульОтсутствующийМодуль.ОпределитьОбъектыСКомандамиЗаполнения(СписокОбъектов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьОбъектыСКомандамиПечатиЛокально(СписокОбъектов)

	СписокОбъектов.Добавить(Документы.ПечатьБезВызовов);

КонецПроцедуры

#КонецОбласти