#Область СлужебныйПрограммныйИнтерфейс

// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыЗаполнения, формирующая команды заполнения объектов.
// Синтаксис процедуры ДобавитьКомандыЗаполнения см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами заполнения.
//
// Пример:
//	Объекты.Добавить(Метаданные.Справочники.Организации);
//   
Процедура ОпределитьОбъектыСКомандамиЗаполнения(Объекты) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗаполнениеОбъектов") Тогда
		МодульЗаполнениеОбъектовВложенныйМодуль = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеОбъектовВложенныйМодуль2");
		МодульЗаполнениеОбъектовВложенныйМодуль.ОпределитьОбъектыСКомандамиЗаполнения(Объекты);
	КонецЕсли;
	
	ОпределитьОбъектыСКомандамиПечатиЛокально(Объекты);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ОтсутствующаяПодсистема") Тогда
		МодульОтсутствующийМодуль = ОбщегоНазначения.ОбщийМодуль("ОтсутствующийМодуль");
		МодульОтсутствующийМодуль.ОпределитьОбъектыСКомандамиЗаполнения(Объекты);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьОбъектыСКомандамиПечатиЛокально(Объекты)

	Объекты.Добавить(Документы.ЗаполнениеБезВызовов);

КонецПроцедуры

#КонецОбласти