//@skip-warning
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтандартнаяОбработка = Истина;

	Если Параметры.Ключ.Пустая() Тогда
		СтандартнаяОбработка = Истина;
	КонецЕсли;

	СервернаяПроцедура(СтандартнаяОбработка);

	ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды");

КонецПроцедуры

//@skip-warning
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

КонецПроцедуры

//@skip-warning
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура СервернаяПроцедура(СтандартнаяОбработка)

	СтандартнаяОбработка = Истина;

КонецПроцедуры